#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.6`
* Working Directory 📂`./modules/test`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mmodule.setup.module.storage_account.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.ai_service.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.setup.module.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.setup.module.ai_studio_hub.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.ai_studio_project.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.setup.module.application_insights.azurerm_application_insights.application_insights: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Insights/components/mbprj003-int-ai001][0m
[0m[1mmodule.setup.module.container_registry.azurerm_container_registry.container_registry: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.ContainerRegistry/registries/mbprj003intacr001][0m
[0m[1mmodule.ai_service.azurerm_cognitive_account.cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.CognitiveServices/accounts/mbprj002-aoai001][0m
[0m[1mmodule.setup.module.ai_studio_hub.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD05ZThjYzgyNC0yY2E3LTQwYjYtYmNmOC1hY2Y2NDg3NWQ1OGQ7b2JqZWN0SWQ9OGU5N2I5YTMtNDcxNC00ZWQ0LWIxYTYtNjY2MzhjNWRkOTQwO3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.ai_service.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD05ZThjYzgyNC0yY2E3LTQwYjYtYmNmOC1hY2Y2NDg3NWQ1OGQ7b2JqZWN0SWQ9OGU5N2I5YTMtNDcxNC00ZWQ0LWIxYTYtNjY2MzhjNWRkOTQwO3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.setup.module.storage_account.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD05ZThjYzgyNC0yY2E3LTQwYjYtYmNmOC1hY2Y2NDg3NWQ1OGQ7b2JqZWN0SWQ9OGU5N2I5YTMtNDcxNC00ZWQ0LWIxYTYtNjY2MzhjNWRkOTQwO3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.setup.module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD05ZThjYzgyNC0yY2E3LTQwYjYtYmNmOC1hY2Y2NDg3NWQ1OGQ7b2JqZWN0SWQ9OGU5N2I5YTMtNDcxNC00ZWQ0LWIxYTYtNjY2MzhjNWRkOTQwO3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.ai_studio_project.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD05ZThjYzgyNC0yY2E3LTQwYjYtYmNmOC1hY2Y2NDg3NWQ1OGQ7b2JqZWN0SWQ9OGU5N2I5YTMtNDcxNC00ZWQ0LWIxYTYtNjY2MzhjNWRkOTQwO3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.setup.module.key_vault.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.KeyVault/vaults/mbprj003-int-kv001][0m
[0m[1mmodule.setup.module.storage_account.azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprj003intstg001][0m
[0m[1mmodule.ai_service.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Reading...[0m[0m
[0m[1mmodule.ai_service.azurerm_private_endpoint.private_endpoint_cognitive_account: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj002-aoai001-account-pe][0m
[0m[1mmodule.setup.module.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003-int-kv001-vault-pe][0m
[0m[1mmodule.setup.module.key_vault.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.KeyVault/vaults/mbprj003-int-kv001/providers/Microsoft.Authorization/roleAssignments/aeba7e0b-35b2-45d7-520a-6511905342f9][0m
[0m[1mmodule.setup.module.container_registry.azurerm_private_endpoint.container_registry_private_endpoint: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003intacr001-registry-pe][0m
[0m[1mmodule.ai_service.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_cognitive_account: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.CognitiveServices/accounts/mbprj002-aoai001][0m
[0m[1mmodule.setup.module.key_vault.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-08T12:13:47Z][0m
[0m[1mmodule.ai_service.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-17T09:25:32Z][0m
[0m[1mmodule.setup.module.container_registry.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-08T12:13:53Z][0m
[0m[1mmodule.setup.module.storage_account.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprj003intstg001/providers/Microsoft.Authorization/roleAssignments/dee48adc-793e-ce8d-381a-10f8f2f6541e][0m
[0m[1mmodule.setup.module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["blob"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003intstg001-blob-pe][0m
[0m[1mmodule.setup.module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["file"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003intstg001-file-pe][0m
[0m[1mmodule.setup.module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["table"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003intstg001-table-pe][0m
[0m[1mmodule.setup.module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["queue"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003intstg001-queue-pe][0m
[0m[1mmodule.setup.module.ai_studio_hub.azapi_resource.ai_studio_hub: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj003-int-aih010][0m
[0m[1mmodule.setup.module.storage_account.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-08T12:14:18Z][0m
[0m[1mmodule.ai_studio_project.azapi_resource.ai_studio_project: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj003][0m
[0m[1mmodule.setup.module.ai_studio_hub.azurerm_private_endpoint.private_endpoint_ai_studio_hub: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003-int-aih010-amlworkspace-pe][0m
[0m[1mmodule.ai_studio_hub_outbound_rules.azapi_resource_action.ai_studio_hub_outbound_rules: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj003-int-aih010][0m
[0m[1mmodule.ai_studio_hub_outbound_rules.azapi_resource_action.ai_studio_hub_provision_managed_network[0]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj003-int-aih010/provisionManagedNetwork][0m
[0m[1mmodule.ai_studio_hub_outbound_rules.null_resource.ai_studio_hub_private_endpoints_approval["aoai"]: Refreshing state... [id=1421094748828527752][0m
[0m[1mmodule.ai_studio_hub_outbound_rules.null_resource.ai_studio_hub_private_endpoints_approval["default-storage-table"]: Refreshing state... [id=3462423531738836556][0m
[0m[1mmodule.ai_studio_hub_outbound_rules.null_resource.ai_studio_hub_private_endpoints_approval["default-storage-queue"]: Refreshing state... [id=3168487175720792952][0m
[0m[1mmodule.setup.module.ai_studio_hub.time_sleep.sleep_connectivity: Refreshing state... [id=2024-10-08T17:04:28Z][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.ai_studio_hub_outbound_rules.azapi_resource_action.ai_studio_hub_outbound_rules[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azapi_resource_action" "ai_studio_hub_outbound_rules" {
      [33m~[0m[0m body                   = {
          [33m~[0m[0m properties = {
              [33m~[0m[0m managedNetwork = {
                  [33m~[0m[0m outboundRules = {
                      [33m~[0m[0m default-storage-queue                        = {
                          [33m~[0m[0m destination = {
                              [33m~[0m[0m serviceResourceId = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprj003intstg001" -> (known after apply)
                                [90m# (3 unchanged attributes hidden)[0m[0m
                            }
                            [90m# (3 unchanged attributes hidden)[0m[0m
                        }
                      [33m~[0m[0m default-storage-table                        = {
                          [33m~[0m[0m destination = {
                              [33m~[0m[0m serviceResourceId = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprj003intstg001" -> (known after apply)
                                [90m# (3 unchanged attributes hidden)[0m[0m
                            }
                            [90m# (3 unchanged attributes hidden)[0m[0m
                        }
                        [90m# (48 unchanged attributes hidden)[0m[0m
                    }
                    [90m# (2 unchanged attributes hidden)[0m[0m
                }
            }
        }
      [33m~[0m[0m id                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj003-int-aih010" -> (known after apply)
      [33m~[0m[0m output                 = {} -> (known after apply)
      [33m~[0m[0m resource_id            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj003-int-aih010" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1m  # module.ai_studio_hub_outbound_rules.azapi_resource_action.ai_studio_hub_provision_managed_network[0][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azapi_resource_action" "ai_studio_hub_provision_managed_network" {
      [33m~[0m[0m id                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj003-int-aih010/provisionManagedNetwork" -> (known after apply)
      [33m~[0m[0m output                 = {} -> (known after apply)
      [33m~[0m[0m resource_id            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj003-int-aih010" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (6 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.ai_studio_project.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_ai_studio_project[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_ai_studio_project" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.ai_studio_project.azapi_resource.ai_studio_project[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azapi_resource" "ai_studio_project" {
      [33m~[0m[0m body                      = {
          [33m~[0m[0m properties = {
              [33m~[0m[0m description   = "AI Studio Project - mbprj003" [33m->[0m[0m "AI Studio Project - mbprj004"
              [33m~[0m[0m friendlyName  = "Mbprj003" [33m->[0m[0m "Mbprj004"
              [33m~[0m[0m hubResourceId = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj003-int-aih010" -> (known after apply)
            }
            [90m# (1 unchanged attribute hidden)[0m[0m
        }
      [33m~[0m[0m id                        = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj003" -> (known after apply)
      [33m~[0m[0m name                      = "mbprj003" [33m->[0m[0m "mbprj004" [31m# forces replacement[0m[0m
      [33m~[0m[0m output                    = {} -> (known after apply)
        tags                      = {
            "test" = "aistudioproject"
        }
        [90m# (8 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m identity {
          [33m~[0m[0m principal_id = "2497d7b5-8ab3-4422-a879-34695b5ece00" -> (known after apply)
          [33m~[0m[0m tenant_id    = "37963dd4-f4e6-40f8-a7d6-24b97919e452" -> (known after apply)
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.setup.module.ai_studio_hub.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_ai_studio_hub[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_ai_studio_hub" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.setup.module.ai_studio_hub.azapi_resource.ai_studio_hub[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azapi_resource" "ai_studio_hub" {
      [33m~[0m[0m body                      = {
          [33m~[0m[0m properties = {
              [32m+[0m[0m allowRoleAssignmentOnRG         = false
              [33m~[0m[0m applicationInsights             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Insights/components/mbprj003-int-ai001" -> (known after apply)
              [33m~[0m[0m containerRegistry               = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.ContainerRegistry/registries/mbprj003intacr001" -> (known after apply)
              [33m~[0m[0m friendlyName                    = "Mbprj003 Int Aih010" [33m->[0m[0m "Mbprj004 Int Aih010"
              [33m~[0m[0m keyVault                        = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.KeyVault/vaults/mbprj003-int-kv001" -> (known after apply)
              [33m~[0m[0m storageAccount                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprj003intstg001" -> (known after apply)
              [31m-[0m[0m systemDatastoresAuthMode        = "identity"
                [90m# (12 unchanged attributes hidden)[0m[0m
            }
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
      [33m~[0m[0m id                        = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj003-int-aih010" -> (known after apply)
      [33m~[0m[0m name                      = "mbprj003-int-aih010" [33m->[0m[0m "mbprj004-int-aih010" [31m# forces replacement[0m[0m
      [33m~[0m[0m output                    = {} -> (known after apply)
      [33m~[0m[0m schema_validation_enabled = false [33m->[0m[0m true
        tags                      = {
            "test" = "aistudioproject"
        }
      [33m~[0m[0m type                      = "Microsoft.MachineLearningServices/workspaces@2024-04-01" [33m->[0m[0m "Microsoft.MachineLearningServices/workspaces@2024-07-01-preview"
        [90m# (6 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m identity {
          [33m~[0m[0m principal_id = "72fcc6cf-64ff-4e43-987c-99877a6c85c4" -> (known after apply)
          [33m~[0m[0m tenant_id    = "37963dd4-f4e6-40f8-a7d6-24b97919e452" -> (known after apply)
            [90m# (1 unchanged attribute hidden)[0m[0m
        }
    }

[1m  # module.setup.module.ai_studio_hub.azurerm_private_endpoint.private_endpoint_ai_studio_hub[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_ai_studio_hub" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m custom_network_interface_name = "mbprj003-int-aih010-amlworkspace-nic" [33m->[0m[0m "mbprj004-int-aih010-amlworkspace-nic" [31m# forces replacement[0m[0m
      [33m~[0m[0m id                            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003-int-aih010-amlworkspace-pe" -> (known after apply)
      [33m~[0m[0m name                          = "mbprj003-int-aih010-amlworkspace-pe" [33m->[0m[0m "mbprj004-int-aih010-amlworkspace-pe" [31m# forces replacement[0m[0m
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/networkInterfaces/mbprj003-int-aih010-amlworkspace-nic"
              [31m-[0m[0m name = "mbprj003-int-aih010-amlworkspace-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003-int-aih010-amlworkspace-pe/privateDnsZoneGroups/mbprj003-int-aih010-arecord/privateDnsZoneConfigs/privatelink.api.azureml.ms"
              [31m-[0m[0m name                = "privatelink.api.azureml.ms"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.api.azureml.ms"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "3e1738b0-deb8-4b2c-b9cb-e4510c72c48c.workspace.northeurope.privatelink.api.azureml.ms"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.3.0.4",
                        ]
                      [31m-[0m[0m name         = "3e1738b0-deb8-4b2c-b9cb-e4510c72c48c.workspace.northeurope"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "3e1738b0-deb8-4b2c-b9cb-e4510c72c48c.workspace.northeurope.cert.privatelink.api.azureml.ms"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.3.0.4",
                        ]
                      [31m-[0m[0m name         = "3e1738b0-deb8-4b2c-b9cb-e4510c72c48c.workspace.northeurope.cert"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "*.3e1738b0-deb8-4b2c-b9cb-e4510c72c48c.inference.northeurope.privatelink.api.azureml.ms"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.3.0.6",
                        ]
                      [31m-[0m[0m name         = "*.3e1738b0-deb8-4b2c-b9cb-e4510c72c48c.inference.northeurope"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003-int-aih010-amlworkspace-pe/privateDnsZoneGroups/mbprj003-int-aih010-arecord/privateDnsZoneConfigs/privatelink.notebooks.azure.net"
              [31m-[0m[0m name                = "privatelink.notebooks.azure.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.notebooks.azure.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "ml-mbprj003-in-northeurope-3e1738b0-deb8-4b2c-b9cb-e4510c72c48c.northeurope.privatelink.notebooks.azure.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.3.0.5",
                        ]
                      [31m-[0m[0m name         = "ml-mbprj003-in-northeurope-3e1738b0-deb8-4b2c-b9cb-e4510c72c48c.northeurope"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                          = {
            "test" = "aistudioproject"
        }
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003-int-aih010-amlworkspace-pe/privateDnsZoneGroups/mbprj003-int-aih010-arecord" -> (known after apply)
          [33m~[0m[0m name                 = "mbprj003-int-aih010-arecord" [33m->[0m[0m "mbprj004-int-aih010-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
          [33m~[0m[0m name                              = "mbprj003-int-aih010-amlworkspace-pe" [33m->[0m[0m "mbprj004-int-aih010-amlworkspace-pe" [31m# forces replacement[0m[0m
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.MachineLearningServices/workspaces/mbprj003-int-aih010" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.3.0.4" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.setup.module.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_application_insights" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.setup.module.application_insights.azurerm_application_insights.application_insights[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_application_insights" "application_insights" {
      [33m~[0m[0m app_id                                = "f3c3813e-bcee-4b09-9fb2-06a5a78009cc" -> (known after apply)
      [33m~[0m[0m connection_string                     = (sensitive value)
      [33m~[0m[0m id                                    = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Insights/components/mbprj003-int-ai001" -> (known after apply)
      [33m~[0m[0m instrumentation_key                   = (sensitive value)
      [33m~[0m[0m name                                  = "mbprj003-int-ai001" [33m->[0m[0m "mbprj004-int-ai001" [31m# forces replacement[0m[0m
        tags                                  = {
            "test" = "aistudioproject"
        }
        [90m# (13 unchanged attributes hidden)[0m[0m
    }

[1m  # module.setup.module.container_registry.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_container_registry[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_container_registry" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.setup.module.container_registry.azurerm_container_registry.container_registry[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_container_registry" "container_registry" {
      [32m+[0m[0m admin_password                = (sensitive value)
      [32m+[0m[0m admin_username                = (known after apply)
      [33m~[0m[0m encryption                    = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.ContainerRegistry/registries/mbprj003intacr001" -> (known after apply)
      [33m~[0m[0m login_server                  = "mbprj003intacr001.azurecr.io" -> (known after apply)
      [33m~[0m[0m name                          = "mbprj003intacr001" [33m->[0m[0m "mbprj004intacr001" [31m# forces replacement[0m[0m
      [33m~[0m[0m network_rule_set              = [
          [33m~[0m[0m {
              [31m-[0m[0m ip_rule        = []
                [90m# (1 unchanged attribute hidden)[0m[0m
            },
        ]
        tags                          = {
            "test" = "aistudioproject"
        }
        [90m# (13 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m identity {
          [31m-[0m[0m identity_ids = [] [90m-> null[0m[0m
          [33m~[0m[0m principal_id = "9408f353-4d18-4fbf-a7ca-54fa478568f5" -> (known after apply)
          [33m~[0m[0m tenant_id    = "37963dd4-f4e6-40f8-a7d6-24b97919e452" -> (known after apply)
            [90m# (1 unchanged attribute hidden)[0m[0m
        }
    }

[1m  # module.setup.module.container_registry.azurerm_private_endpoint.container_registry_private_endpoint[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "container_registry_private_endpoint" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m custom_network_interface_name = "mbprj003intacr001-nic" [33m->[0m[0m "mbprj004intacr001-nic" [31m# forces replacement[0m[0m
      [33m~[0m[0m id                            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003intacr001-registry-pe" -> (known after apply)
      [33m~[0m[0m name                          = "mbprj003intacr001-registry-pe" [33m->[0m[0m "mbprj004intacr001-registry-pe" [31m# forces replacement[0m[0m
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/networkInterfaces/mbprj003intacr001-nic"
              [31m-[0m[0m name = "mbprj003intacr001-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003intacr001-registry-pe/privateDnsZoneGroups/mbprj003intacr001-arecord/privateDnsZoneConfigs/privatelink.azurecr.io"
              [31m-[0m[0m name                = "privatelink.azurecr.io"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "mbprj003intacr001.northeurope.data.privatelink.azurecr.io"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.3.0.10",
                        ]
                      [31m-[0m[0m name         = "mbprj003intacr001.northeurope.data"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "mbprj003intacr001.privatelink.azurecr.io"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.3.0.11",
                        ]
                      [31m-[0m[0m name         = "mbprj003intacr001"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                          = {
            "test" = "aistudioproject"
        }
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003intacr001-registry-pe/privateDnsZoneGroups/mbprj003intacr001-arecord" -> (known after apply)
          [33m~[0m[0m name                 = "mbprj003intacr001-arecord" [33m->[0m[0m "mbprj004intacr001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
          [33m~[0m[0m name                              = "mbprj003intacr001-svc" [33m->[0m[0m "mbprj004intacr001-svc" [31m# forces replacement[0m[0m
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.ContainerRegistry/registries/mbprj003intacr001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.3.0.10" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.setup.module.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_key_vault" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.setup.module.key_vault.azurerm_key_vault.key_vault[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_key_vault" "key_vault" {
      [33m~[0m[0m access_policy                   = [
          [31m-[0m[0m {
              [31m-[0m[0m certificate_permissions = [
                  [31m-[0m[0m "all",
                ]
              [31m-[0m[0m key_permissions         = [
                  [31m-[0m[0m "all",
                ]
              [31m-[0m[0m object_id               = "72fcc6cf-64ff-4e43-987c-99877a6c85c4"
              [31m-[0m[0m secret_permissions      = [
                  [31m-[0m[0m "all",
                ]
              [31m-[0m[0m storage_permissions     = []
              [31m-[0m[0m tenant_id               = "37963dd4-f4e6-40f8-a7d6-24b97919e452"
                [90m# (1 unchanged attribute hidden)[0m[0m
            },
        ]
      [33m~[0m[0m id                              = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.KeyVault/vaults/mbprj003-int-kv001" -> (known after apply)
      [33m~[0m[0m name                            = "mbprj003-int-kv001" [33m->[0m[0m "mbprj004-int-kv001" [31m# forces replacement[0m[0m
        tags                            = {
            "test" = "aistudioproject"
        }
      [33m~[0m[0m vault_uri                       = "https://mbprj003-int-kv001.vault.azure.net/" -> (known after apply)
        [90m# (11 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m contact (known after apply)

      [33m~[0m[0m network_acls {
          [31m-[0m[0m ip_rules                   = [] [90m-> null[0m[0m
          [31m-[0m[0m virtual_network_subnet_ids = [] [90m-> null[0m[0m
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.setup.module.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_cognitive_account_vault" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m custom_network_interface_name = "mbprj003-int-kv001-vault-nic" [33m->[0m[0m "mbprj004-int-kv001-vault-nic" [31m# forces replacement[0m[0m
      [33m~[0m[0m id                            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003-int-kv001-vault-pe" -> (known after apply)
      [33m~[0m[0m name                          = "mbprj003-int-kv001-vault-pe" [33m->[0m[0m "mbprj004-int-kv001-vault-pe" [31m# forces replacement[0m[0m
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/networkInterfaces/mbprj003-int-kv001-vault-nic"
              [31m-[0m[0m name = "mbprj003-int-kv001-vault-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003-int-kv001-vault-pe/privateDnsZoneGroups/mbprj003-int-kv001-arecord/privateDnsZoneConfigs/privatelink.vaultcore.azure.net"
              [31m-[0m[0m name                = "privatelink.vaultcore.azure.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "mbprj003-int-kv001.privatelink.vaultcore.azure.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.3.0.12",
                        ]
                      [31m-[0m[0m name         = "mbprj003-int-kv001"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                          = {
            "test" = "aistudioproject"
        }
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003-int-kv001-vault-pe/privateDnsZoneGroups/mbprj003-int-kv001-arecord" -> (known after apply)
          [33m~[0m[0m name                 = "mbprj003-int-kv001-arecord" [33m->[0m[0m "mbprj004-int-kv001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
          [33m~[0m[0m name                              = "mbprj003-int-kv001-vault-svc" [33m->[0m[0m "mbprj004-int-kv001-vault-svc" [31m# forces replacement[0m[0m
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.KeyVault/vaults/mbprj003-int-kv001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.3.0.12" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.setup.module.key_vault.azurerm_role_assignment.current_roleassignment_key_vault[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_role_assignment" "current_roleassignment_key_vault" {
      [33m~[0m[0m id                                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.KeyVault/vaults/mbprj003-int-kv001/providers/Microsoft.Authorization/roleAssignments/aeba7e0b-35b2-45d7-520a-6511905342f9" -> (known after apply)
      [33m~[0m[0m name                                   = "aeba7e0b-35b2-45d7-520a-6511905342f9" -> (known after apply)
      [33m~[0m[0m principal_type                         = "ServicePrincipal" -> (known after apply)
      [33m~[0m[0m role_definition_id                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/providers/Microsoft.Authorization/roleDefinitions/00482a5a-887f-4fb3-b363-3b7fe8e74483" -> (known after apply)
      [33m~[0m[0m scope                                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.KeyVault/vaults/mbprj003-int-kv001" -> (known after apply) [31m# forces replacement[0m[0m
      [32m+[0m[0m skip_service_principal_aad_check       = (known after apply)
        [90m# (6 unchanged attributes hidden)[0m[0m
    }

[1m  # module.setup.module.storage_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_storage_account" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.setup.module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["blob"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_storage_account" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m custom_network_interface_name = "mbprj003intstg001-blob-nic" [33m->[0m[0m "mbprj004intstg001-blob-nic" [31m# forces replacement[0m[0m
      [33m~[0m[0m id                            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003intstg001-blob-pe" -> (known after apply)
      [33m~[0m[0m name                          = "mbprj003intstg001-blob-pe" [33m->[0m[0m "mbprj004intstg001-blob-pe" [31m# forces replacement[0m[0m
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/networkInterfaces/mbprj003intstg001-blob-nic"
              [31m-[0m[0m name = "mbprj003intstg001-blob-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003intstg001-blob-pe/privateDnsZoneGroups/mbprj003intstg001-arecord/privateDnsZoneConfigs/privatelink.blob.core.windows.net"
              [31m-[0m[0m name                = "privatelink.blob.core.windows.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "mbprj003intstg001.privatelink.blob.core.windows.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.3.0.15",
                        ]
                      [31m-[0m[0m name         = "mbprj003intstg001"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                          = {
            "test" = "aistudioproject"
        }
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003intstg001-blob-pe/privateDnsZoneGroups/mbprj003intstg001-arecord" -> (known after apply)
          [33m~[0m[0m name                 = "mbprj003intstg001-arecord" [33m->[0m[0m "mbprj004intstg001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
          [33m~[0m[0m name                              = "mbprj003intstg001-blob-svc" [33m->[0m[0m "mbprj004intstg001-blob-svc" [31m# forces replacement[0m[0m
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprj003intstg001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.3.0.15" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.setup.module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["file"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_storage_account" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m custom_network_interface_name = "mbprj003intstg001-file-nic" [33m->[0m[0m "mbprj004intstg001-file-nic" [31m# forces replacement[0m[0m
      [33m~[0m[0m id                            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003intstg001-file-pe" -> (known after apply)
      [33m~[0m[0m name                          = "mbprj003intstg001-file-pe" [33m->[0m[0m "mbprj004intstg001-file-pe" [31m# forces replacement[0m[0m
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/networkInterfaces/mbprj003intstg001-file-nic"
              [31m-[0m[0m name = "mbprj003intstg001-file-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003intstg001-file-pe/privateDnsZoneGroups/mbprj003intstg001-arecord/privateDnsZoneConfigs/privatelink.file.core.windows.net"
              [31m-[0m[0m name                = "privatelink.file.core.windows.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "mbprj003intstg001.privatelink.file.core.windows.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.3.0.17",
                        ]
                      [31m-[0m[0m name         = "mbprj003intstg001"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                          = {
            "test" = "aistudioproject"
        }
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003intstg001-file-pe/privateDnsZoneGroups/mbprj003intstg001-arecord" -> (known after apply)
          [33m~[0m[0m name                 = "mbprj003intstg001-arecord" [33m->[0m[0m "mbprj004intstg001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
          [33m~[0m[0m name                              = "mbprj003intstg001-file-svc" [33m->[0m[0m "mbprj004intstg001-file-svc" [31m# forces replacement[0m[0m
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprj003intstg001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.3.0.17" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.setup.module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["queue"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_storage_account" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m custom_network_interface_name = "mbprj003intstg001-queue-nic" [33m->[0m[0m "mbprj004intstg001-queue-nic" [31m# forces replacement[0m[0m
      [33m~[0m[0m id                            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003intstg001-queue-pe" -> (known after apply)
      [33m~[0m[0m name                          = "mbprj003intstg001-queue-pe" [33m->[0m[0m "mbprj004intstg001-queue-pe" [31m# forces replacement[0m[0m
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/networkInterfaces/mbprj003intstg001-queue-nic"
              [31m-[0m[0m name = "mbprj003intstg001-queue-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003intstg001-queue-pe/privateDnsZoneGroups/mbprj003intstg001-arecord/privateDnsZoneConfigs/privatelink.queue.core.windows.net"
              [31m-[0m[0m name                = "privatelink.queue.core.windows.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "mbprj003intstg001.privatelink.queue.core.windows.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.3.0.13",
                        ]
                      [31m-[0m[0m name         = "mbprj003intstg001"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                          = {
            "test" = "aistudioproject"
        }
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003intstg001-queue-pe/privateDnsZoneGroups/mbprj003intstg001-arecord" -> (known after apply)
          [33m~[0m[0m name                 = "mbprj003intstg001-arecord" [33m->[0m[0m "mbprj004intstg001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
          [33m~[0m[0m name                              = "mbprj003intstg001-queue-svc" [33m->[0m[0m "mbprj004intstg001-queue-svc" [31m# forces replacement[0m[0m
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprj003intstg001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.3.0.13" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.setup.module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["table"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_storage_account" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m custom_network_interface_name = "mbprj003intstg001-table-nic" [33m->[0m[0m "mbprj004intstg001-table-nic" [31m# forces replacement[0m[0m
      [33m~[0m[0m id                            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003intstg001-table-pe" -> (known after apply)
      [33m~[0m[0m name                          = "mbprj003intstg001-table-pe" [33m->[0m[0m "mbprj004intstg001-table-pe" [31m# forces replacement[0m[0m
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/networkInterfaces/mbprj003intstg001-table-nic"
              [31m-[0m[0m name = "mbprj003intstg001-table-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003intstg001-table-pe/privateDnsZoneGroups/mbprj003intstg001-arecord/privateDnsZoneConfigs/privatelink.table.core.windows.net"
              [31m-[0m[0m name                = "privatelink.table.core.windows.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.table.core.windows.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "mbprj003intstg001.privatelink.table.core.windows.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.3.0.16",
                        ]
                      [31m-[0m[0m name         = "mbprj003intstg001"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                          = {
            "test" = "aistudioproject"
        }
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Network/privateEndpoints/mbprj003intstg001-table-pe/privateDnsZoneGroups/mbprj003intstg001-arecord" -> (known after apply)
          [33m~[0m[0m name                 = "mbprj003intstg001-arecord" [33m->[0m[0m "mbprj004intstg001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
          [33m~[0m[0m name                              = "mbprj003intstg001-table-svc" [33m->[0m[0m "mbprj004intstg001-table-svc" [31m# forces replacement[0m[0m
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprj003intstg001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.3.0.16" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.setup.module.storage_account.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_role_assignment" "current_roleassignment_storage_blob_data_owner" {
      [33m~[0m[0m id                                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprj003intstg001/providers/Microsoft.Authorization/roleAssignments/dee48adc-793e-ce8d-381a-10f8f2f6541e" -> (known after apply)
      [33m~[0m[0m name                                   = "dee48adc-793e-ce8d-381a-10f8f2f6541e" -> (known after apply)
      [33m~[0m[0m role_definition_id                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> (known after apply)
      [33m~[0m[0m scope                                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprj003intstg001" -> (known after apply) [31m# forces replacement[0m[0m
      [32m+[0m[0m skip_service_principal_aad_check       = (known after apply)
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # module.setup.module.storage_account.azurerm_storage_account.storage_account[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_storage_account" "storage_account" {
      [33m~[0m[0m id                                 = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg/providers/Microsoft.Storage/storageAccounts/mbprj003intstg001" -> (known after apply)
      [33m~[0m[0m name                               = "mbprj003intstg001" [33m->[0m[0m "mbprj004intstg001" [31m# forces replacement[0m[0m
      [33m~[0m[0m primary_access_key                 = (sensitive value)
      [33m~[0m[0m primary_blob_connection_string     = (sensitive value)
      [33m~[0m[0m primary_blob_endpoint              = "https://mbprj003intstg001.blob.core.windows.net/" -> (known after apply)
      [33m~[0m[0m primary_blob_host                  = "mbprj003intstg001.blob.core.windows.net" -> (known after apply)
      [32m+[0m[0m primary_blob_internet_endpoint     = (known after apply)
      [32m+[0m[0m primary_blob_internet_host         = (known after apply)
      [32m+[0m[0m primary_blob_microsoft_endpoint    = (known after apply)
      [32m+[0m[0m primary_blob_microsoft_host        = (known after apply)
      [33m~[0m[0m primary_connection_string          = (sensitive value)
      [33m~[0m[0m primary_dfs_endpoint               = "https://mbprj003intstg001.dfs.core.windows.net/" -> (known after apply)
      [33m~[0m[0m primary_dfs_host                   = "mbprj003intstg001.dfs.core.windows.net" -> (known after apply)
      [32m+[0m[0m primary_dfs_internet_endpoint      = (known after apply)
      [32m+[0m[0m primary_dfs_internet_host          = (known after apply)
      [32m+[0m[0m primary_dfs_microsoft_endpoint     = (known after apply)
      [32m+[0m[0m primary_dfs_microsoft_host         = (known after apply)
      [33m~[0m[0m primary_file_endpoint              = "https://mbprj003intstg001.file.core.windows.net/" -> (known after apply)
      [33m~[0m[0m primary_file_host                  = "mbprj003intstg001.file.core.windows.net" -> (known after apply)
      [32m+[0m[0m primary_file_internet_endpoint     = (known after apply)
      [32m+[0m[0m primary_file_internet_host         = (known after apply)
      [32m+[0m[0m primary_file_microsoft_endpoint    = (known after apply)
      [32m+[0m[0m primary_file_microsoft_host        = (known after apply)
      [33m~[0m[0m primary_location                   = "northeurope" -> (known after apply)
      [33m~[0m[0m primary_queue_endpoint             = "https://mbprj003intstg001.queue.core.windows.net/" -> (known after apply)
      [33m~[0m[0m primary_queue_host                 = "mbprj003intstg001.queue.core.windows.net" -> (known after apply)
      [32m+[0m[0m primary_queue_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m primary_queue_microsoft_host       = (known after apply)
      [33m~[0m[0m primary_table_endpoint             = "https://mbprj003intstg001.table.core.windows.net/" -> (known after apply)
      [33m~[0m[0m primary_table_host                 = "mbprj003intstg001.table.core.windows.net" -> (known after apply)
      [32m+[0m[0m primary_table_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m primary_table_microsoft_host       = (known after apply)
      [33m~[0m[0m primary_web_endpoint               = "https://mbprj003intstg001.z16.web.core.windows.net/" -> (known after apply)
      [33m~[0m[0m primary_web_host                   = "mbprj003intstg001.z16.web.core.windows.net" -> (known after apply)
      [32m+[0m[0m primary_web_internet_endpoint      = (known after apply)
      [32m+[0m[0m primary_web_internet_host          = (known after apply)
      [32m+[0m[0m primary_web_microsoft_endpoint     = (known after apply)
      [32m+[0m[0m primary_web_microsoft_host         = (known after apply)
      [33m~[0m[0m secondary_access_key               = (sensitive value)
      [32m+[0m[0m secondary_blob_connection_string   = (sensitive value)
      [32m+[0m[0m secondary_blob_endpoint            = (known after apply)
      [32m+[0m[0m secondary_blob_host                = (known after apply)
      [32m+[0m[0m secondary_blob_internet_endpoint   = (known after apply)
      [32m+[0m[0m secondary_blob_internet_host       = (known after apply)
      [32m+[0m[0m secondary_blob_microsoft_endpoint  = (known after apply)
      [32m+[0m[0m secondary_blob_microsoft_host      = (known after apply)
      [33m~[0m[0m secondary_connection_string        = (sensitive value)
      [32m+[0m[0m secondary_dfs_endpoint             = (known after apply)
      [32m+[0m[0m secondary_dfs_host                 = (known after apply)
      [32m+[0m[0m secondary_dfs_internet_endpoint    = (known after apply)
      [32m+[0m[0m secondary_dfs_internet_host        = (known after apply)
      [32m+[0m[0m secondary_dfs_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m secondary_dfs_microsoft_host       = (known after apply)
      [32m+[0m[0m secondary_file_endpoint            = (known after apply)
      [32m+[0m[0m secondary_file_host                = (known after apply)
      [32m+[0m[0m secondary_file_internet_endpoint   = (known after apply)
      [32m+[0m[0m secondary_file_internet_host       = (known after apply)
      [32m+[0m[0m secondary_file_microsoft_endpoint  = (known after apply)
      [32m+[0m[0m secondary_file_microsoft_host      = (known after apply)
      [32m+[0m[0m secondary_location                 = (known after apply)
      [32m+[0m[0m secondary_queue_endpoint           = (known after apply)
      [32m+[0m[0m secondary_queue_host               = (known after apply)
      [32m+[0m[0m secondary_queue_microsoft_endpoint = (known after apply)
      [32m+[0m[0m secondary_queue_microsoft_host     = (known after apply)
      [32m+[0m[0m secondary_table_endpoint           = (known after apply)
      [32m+[0m[0m secondary_table_host               = (known after apply)
      [32m+[0m[0m secondary_table_microsoft_endpoint = (known after apply)
      [32m+[0m[0m secondary_table_microsoft_host     = (known after apply)
      [32m+[0m[0m secondary_web_endpoint             = (known after apply)
      [32m+[0m[0m secondary_web_host                 = (known after apply)
      [32m+[0m[0m secondary_web_internet_endpoint    = (known after apply)
      [32m+[0m[0m secondary_web_internet_host        = (known after apply)
      [32m+[0m[0m secondary_web_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m secondary_web_microsoft_host       = (known after apply)
        tags                               = {
            "test" = "aistudioproject"
        }
        [90m# (24 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m blob_properties {
          [31m-[0m[0m change_feed_retention_in_days = 0 [90m-> null[0m[0m
          [32m+[0m[0m default_service_version       = (known after apply)
            [90m# (3 unchanged attributes hidden)[0m[0m

            [90m# (3 unchanged blocks hidden)[0m[0m
        }

      [33m~[0m[0m network_rules {
          [33m~[0m[0m ip_rules                   = [] -> (known after apply)
          [33m~[0m[0m virtual_network_subnet_ids = [] -> (known after apply)
            [90m# (2 unchanged attributes hidden)[0m[0m

          [31m-[0m[0m private_link_access {
              [31m-[0m[0m endpoint_resource_id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/providers/Microsoft.Security/datascanners/StorageDataScanner" [90m-> null[0m[0m
              [31m-[0m[0m endpoint_tenant_id   = "37963dd4-f4e6-40f8-a7d6-24b97919e452" [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m queue_properties (known after apply)
      [31m-[0m[0m queue_properties {
          [31m-[0m[0m hour_metrics {
              [31m-[0m[0m enabled               = true [90m-> null[0m[0m
              [31m-[0m[0m include_apis          = true [90m-> null[0m[0m
              [31m-[0m[0m retention_policy_days = 7 [90m-> null[0m[0m
              [31m-[0m[0m version               = "1.0" [90m-> null[0m[0m
            }
          [31m-[0m[0m logging {
              [31m-[0m[0m delete                = false [90m-> null[0m[0m
              [31m-[0m[0m read                  = false [90m-> null[0m[0m
              [31m-[0m[0m retention_policy_days = 0 [90m-> null[0m[0m
              [31m-[0m[0m version               = "1.0" [90m-> null[0m[0m
              [31m-[0m[0m write                 = false [90m-> null[0m[0m
            }
          [31m-[0m[0m minute_metrics {
              [31m-[0m[0m enabled               = false [90m-> null[0m[0m
              [31m-[0m[0m include_apis          = false [90m-> null[0m[0m
              [31m-[0m[0m retention_policy_days = 0 [90m-> null[0m[0m
              [31m-[0m[0m version               = "1.0" [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m share_properties (known after apply)
      [31m-[0m[0m share_properties {
          [31m-[0m[0m cors_rule {
              [31m-[0m[0m allowed_headers    = [
                  [31m-[0m[0m "*",
                ] [90m-> null[0m[0m
              [31m-[0m[0m allowed_methods    = [
                  [31m-[0m[0m "GET",
                  [31m-[0m[0m "HEAD",
                  [31m-[0m[0m "PUT",
                  [31m-[0m[0m "DELETE",
                  [31m-[0m[0m "OPTIONS",
                  [31m-[0m[0m "POST",
                ] [90m-> null[0m[0m
              [31m-[0m[0m allowed_origins    = [
                  [31m-[0m[0m "https://mlworkspace.azure.ai",
                  [31m-[0m[0m "https://ml.azure.com",
                  [31m-[0m[0m "https://*.ml.azure.com",
                  [31m-[0m[0m "https://ai.azure.com",
                  [31m-[0m[0m "https://*.ai.azure.com",
                ] [90m-> null[0m[0m
              [31m-[0m[0m exposed_headers    = [
                  [31m-[0m[0m "*",
                ] [90m-> null[0m[0m
              [31m-[0m[0m max_age_in_seconds = 1800 [90m-> null[0m[0m
            }
          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days = 7 [90m-> null[0m[0m
            }
        }

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1mPlan:[0m 17 to add, 0 to change, 17 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>